{
    "reverse_high_five": {
        "name": "Reverse High Five",
        "file": "resources\\reversehighfive.gif",
        "url": "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-560w,f_auto,q_auto:best/newscms/2019_21/2863736/better_reversehighfive.gif",
        "description": "While standing tall, shrug your shoulders up towards your ears and then relax them down. Turn the palms to face the back of the room. Press the hands back as if you're trying to give someone a double high five. Pulse 10 times and then rest.",
        "complete": false,
        "timer": null
    },
    "chest_opener": {
        "name": "Chest Opener",
        "file": "resources\\chestopener.gif",
        "url": "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-560w,f_auto,q_auto:best/newscms/2019_21/2863721/better_chest_opener.gif",
        "description": "To stretch the front of the body, clasp your hands behind your back and push down towards the ground while reaching the arms away from the back of your body. Open your chest and lift your head up to feel a stretch across your chest. Hold for 5 breaths, and then release.",
        "complete": false,
        "timer": null
    },
    "goal_post_squeeze": {
        "name": "Goal Post Squeeze",
        "file": "resources\\goalpostsqueeze.gif",
        "url": "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-560w,f_auto,q_auto:best/newscms/2019_21/2863711/better_goalpostsqueeze.gif",
        "description": "While sitting upright, lift your arms up into a goalpost position with your elbows bent at a 90 degree angle even with your shoulders. Relax your shoulders down, and then pull the elbows towards the back of the room. Imagine that you're squeezing a marble in between your shoulder blades as you work the upper back. Release. Repeat 10 times.",
        "complete": false,
        "timer": null
    },
    "arm_pit_opener": {
        "name": "Arm Pit Opener",
        "file": "resources\\armpitopener.gif",
        "url": "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-560w,f_auto,q_auto:best/newscms/2019_21/2863731/better_armpit_opener.gif",
        "description": "To open up the chest, reach the arms out to the sides and up and overhead, clasp the hands at the top. Stretch the arms up, and then bend the elbows towards the back of the room to stretch the chest and armpits. Hold for a breathe, and then straighten the arms back up. Repeat 10 times.",
        "complete": false,
        "timer": null
    },
    "mini_cobra": {
        "name": "Mini Cobra",
        "file": "resources\\minicobra.gif",
        "url": "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-560w,f_auto,q_auto:best/newscms/2019_21/2864096/better_minicobra.gif",
        "description": "Lying down on your stomach, place your hands flat on the ground under your shoulders. Pull your naval in towards your spine, and squeeze your inner thighs together. Rest your forehead down on the ground. This is the starting position. Pretend that you're pushing a marble forward with your nose, and bring your head forward and up as you press down through your palms to lift your shoulders and chest off the ground. Keep the elbows bent. Squeeze your shoulder blades together to work your upper back even more. Then, slowly lower back down to the ground resting your forehead down. Repeat this 10 times.",
        "complete": false,
        "timer": null
    },
    "arm_roll_stretch": {
        "name": "Arm Roll",
        "file": "resources\\armrollstretch.gif",
        "url": "https://media-cldnry.s-nbcnews.com/image/upload/t_fit-560w,f_auto,q_auto:best/newscms/2019_21/2863996/better_arm_roll_stretch.gif",
        "description": "Lying down on your stomach, reach your right arm out to the right directly in line with your shoulder. Place your left hand on the ground under your left shoulder and use it to gently push your body to the right, rolling towards the right arm (while it remains on the ground). You can bend your left knee and place your left foot flat on the ground behind your right knee for stabilization. Hold this stretch for 30 seconds or 5 deep breaths. Feel the stretch in the front of the chest and in the armpit of the right side. Then repeat to the left side.",
        "complete": false,
        "timer": [
            30
        ]
    },
    "foam_roller_back_roll": {
        "name": "Foam Roller Back Roll",
        "file": "resources\\foamrollerbackroll.gif",
        "url": "",
        "description": "Begin by lying on your back with the foam roller positioned underneath your upper back. Your knees should be bent with your feet flat on the floor and your arms can either be down by your sides or crossed in front of your chest. Brace your core and lift yourself up into a shallow bridge position. Slowly start to roll up and down between your lower neck and mid-back, stopping at tight areas along the way. Repeat for 30 seconds.",
        "complete": false,
        "timer": [
            30
        ]
    },
    "foam_roller_back_stretch": {
        "name": "Foam Roller Back Stretch",
        "file": "resources\\foamrollerbackstretch.gif",
        "url": "",
        "description": "Lie down on your back, knees bent with your feet on the floor. Grab your foam roller, sit up, and place it below and parallel to your upper back. Hug yourself then extend your back over the foam roller. Come back up. (Do not let the foam roller roll!) Repeat until you feel your back relax. Pick up the foam roller and place it higher or lower on your upper back. Repeat the process until you've covered the whole region.",
        "complete": false,
        "timer": null
    },
    "foam_roller_chest_opener": {
        "name": "Foam Roller Chest Opener",
        "file": "resources\\foamrollerchestopener.gif",
        "url": "",
        "description": "Place the foam roller vertically on the floor and lie your head, back, and butt upon it so that you are fully supported. Bend your knees and plant both feet into the ground. Cactus those arms so that your hands are by your ears, elbows bent at 90 degrees. Bring the arms as close to the floor as you can. Hold for 2 seconds then bring your arms together. Repeat until you've reached your desired massage time.",
        "complete": false,
        "timer": null
    },
    "childs_pose": {
        "name": "Child's Pose",
        "file": "resources\\childspose.gif",
        "url": "https://thumbs.gfycat.com/HalfImmenseAnchovy-size_restricted.gif",
        "description": "With your hands and knees on the ground, sink back through your hips to rest them on your heels. Hinge at your hips as you fold forward, walking your hands out in front of you. Rest your belly on your thighs. Extend your arms in front of or alongside your body with your palms facing up. Focus on breathing deeply and relaxing any areas of tension or tightness. Hold this pose for up to 1 minute.",
        "complete": false,
        "timer": [
            60
        ]
    },
    "knee_to_chest": {
        "name": "Knee to Chest",
        "file": "resources\\kneetochest.gif",
        "url": "https://thumbs.gfycat.com/BewitchedWellinformedDuckling-size_restricted.gif",
        "description": "Lie on your back with both knees bent and your feet flat on the floor. Keep your left knee bent or extend it straight out along the floor. Draw your right knee into your chest, clasping your hands behind your thigh or at the top of your shinbone. Lengthen your spine all the way down to your tailbone, and avoid lifting your hips. Breathe deeply, releasing any tension. Hold this pose for 30 seconds to 1 minute. Repeat with the other leg.",
        "complete": false,
        "timer": [
            30,
            30,
            30,
            30
        ]
    },
    "piriformis_stretch": {
        "name": "Piriformis Stretch",
        "file": "resources\\piriformis.gif",
        "url": "https://thumbs.gfycat.com/NegligibleJointGlobefish-size_restricted.gif",
        "description": "Lie on your back with both knees bent and your feet flat on the floor. Place your right ankle at the base of your left thigh. Then, place your hands behind your left thigh and pull up toward your chest until you feel a stretch. Hold this position for 30 seconds to 1 minute. Then do the opposite side.",
        "complete": false,
        "timer": [
            30,
            30,
            30,
            30
        ]
    },
    "seated_spinal_twist": {
        "name": "Seated Spinal Twist",
        "file": "resources\\seatedspinaltwist.gif",
        "url": "https://thumbs.gfycat.com/FearlessUnimportantGoldeneye-size_restricted.gif",
        "description": "Sit on the floor with both legs extended out in front. Bend your left knee and place your foot to the outside of your right thigh. Place your right arm on the outside of your left thigh. Place your left hand behind you for support. Starting at the base of your spine, twist to the left side. Hold this pose for up to 1 minute. Repeat on the other side.",
        "complete": false,
        "timer": [
            60,
            60
        ]
    },
    "pelvic_tilt": {
        "name": "Pelvic Tilt",
        "file": "resources\\pelvictilt.gif",
        "url": "https://post.healthline.com/wp-content/uploads/2021/09/400x400_Situps_While_Pregnany_Are_They_Safe_Pelvic_Tilts_Adjustment.gif",
        "description": "Lie on your back with both knees bent and feet flat on the floor. Engage your abdominal muscles as you flatten your back against the floor. Breathe normally, holding this position for up to 10 seconds. Release and take a few deep breaths to relax. Do 1 to 3 sets of 3 to 5 repetitions.",
        "complete": false,
        "timer": [
            10,
            10,
            10
        ]
    },
    "cat_cow": {
        "name": "Cat Cow",
        "file": "resources\\catcow.gif",
        "url": "https://thumbs.gfycat.com/ShimmeringVainBee-size_restricted.gif",
        "description": "Come onto all fours in a tabletop position (hands and knees on the ground). Press into your hands and feet as you inhale to look up, allowing your belly to fill with air. Exhale, tucking your chin into your chest and arching your spine toward the ceiling. Continue this pattern of movement, moving with each breath. Do this for 1 to 2 minutes.",
        "complete": false,
        "timer": [
            60,
            60
        ]
    },
    "sphinx_stretch": {
        "name": "Sphinx Stretch",
        "file": "resources\\sphinxstretch.gif",
        "url": "https://post.healthline.com/wp-content/uploads/2021/09/HL-01.01.SphinxPose.gif",
        "description": "Lie on your stomach with your elbows underneath your shoulders and your hands extended in front, palms facing down. Set your feet slightly apart. It's OK for your big toes to touch. Gently engage your lower back, buttocks, and thighs as you lift your head and chest. Stay strong in your lower back and abdominals, breathing deeply. Press your pelvis into the floor. Gaze straight ahead or gently close your eyes. Hold this pose for 30 seconds to 1 minute.",
        "complete": false,
        "timer": [
            30,
            30
        ]
    },
    "upper_trapezius_stretch": {
        "name": "Upper Trapezius Stretch",
        "file": "resources\\uppertrapeziusstretch.gif",
        "url": "https://i0.wp.com/post.healthline.com/wp-content/uploads/2022/02/HL-08.02.UpperTrapeziusStretch.gif",
        "description": "While standing straight or sitting in a chair, take your right hand and place it on the back of your head. Take your left hand and tuck it behind your back. Using your right hand, gently pull your head toward your right shoulder. Hold this for 10-15 seconds. Repeat on the other side.",
        "complete": false,
        "timer": [
            15,
            15
        ]
    },
    "wall_stretch": {
        "name": "Wall Stretch",
        "file": "resources\\wallstretch.gif",
        "url": "https://cdn-prod.medicalnewstoday.com/content/images/articles/325/325373/wall-stretch-exercise-gif.gif",
        "description": "Stand with the right side of the body facing a wall. Bend the right arm at the elbow and place the forearm against the wall. The upper arm should be completely straight so that the elbow forms a 90-degree angle. Gently take a step forward with the right foot and twist to the left, allowing the right shoulder and upper back to stretch. Hold the stretch for a few seconds, then return to the starting position. Repeat the stretch several times on both sides.",
        "complete": false,
        "timer": [
            15,
            15
        ]
    },
    "trunk_rotation": {
        "name": "Trunk Rotation",
        "file": "resources\\trunkrotation.gif",
        "url": "https://cdn-prod.medicalnewstoday.com/content/images/articles/325/325373/trunk-rotation-stretch-and-exercise-gif.gif",
        "description": "Lie on the back with the knees bent and the feet flat. Gently rotate the knees to the right, keeping them bent. Hold this position for a few seconds. Return the knees to the center. Repeat the stretch several times on both sides.",
        "complete": false,
        "timer": [
            30,
            30
        ]
    },
    "shoulder_roll": {
        "name": "Shoulder Roll",
        "file": "resources\\shoulderroll.gif",
        "url": "https://cdn-prod.medicalnewstoday.com/content/images/articles/325/325373/shoulder-roll-stretch-and-exercise-gif.gif",
        "description": "Stand or sit up straight, keeping the arms down by the sides. Gently roll the shoulders forward, lifting them up and down in a continuous circular motion. Try to keep the arms relaxed. Do this for around 30 seconds, then repeat it in the opposite direction.",
        "complete": false,
        "timer": [
            30,
            30
        ]
    },
    "neck_flexion": {
        "name": "Neck flexion",
        "file": "resources\\neckflexion.gif",
        "url": "https://cdn-prod.medicalnewstoday.com/content/images/articles/325/325373/neck-flexion-stretch-and-exercise-gif.gif",
        "description": "Sit or stand up straight. Gently drop the chin to the chest, making sure to stop if there is any pain or discomfort. Roll the head so that the right ear is down toward the right shoulder. Hold this position for a few seconds. Keeping the chin down, slowly rotate the head back, continuing until the left ear is near the left shoulder. Hold this position for a few seconds. Continue this gentle rotation of the head from shoulder to shoulder several times. Pause and deepen the stretch whenever there is muscle tension.",
        "complete": false,
        "timer": [
            15
        ]
    },
    "overhead_arm_reach": {
        "name": "Overhead Arm Reach",
        "file": "resources\\overheadarmreach.gif",
        "url": "https://cdn-prod.medicalnewstoday.com/content/images/articles/325/325373/overhead-arm-reach-stretch-gif.gif",
        "description": "Begin in a sitting or standing position. Stretch the arms above the head. Lean to the right, keeping both arms stretched upward. To deepen the stretch, use the right hand to gently pull the left arm to the right. Return to the starting position. Repeat the stretch several times on both sides.",
        "complete": false,
        "timer": [
            15,
            15
        ]
    },
    "levator_scapulae_stretch": {
        "name": "Levator scapulae stretch",
        "file": "resources\\levatorscapulaestretch.gif",
        "url": "https://i0.wp.com/post.healthline.com/wp-content/uploads/2022/02/HL-08.03.LevatorScapulaeStretch.gif",
        "description": "While standing straight or sitting in a chair, turn your neck 45 degrees to the left. Bend your neck downward (imagine you're looking into a shirt pocket). You can use your left hand for a greater stretch. Hold this for 10-15 seconds. Repeat on the other side.",
        "complete": false,
        "timer": [
            15,
            15
        ]
    },
    "puppy_pose": {
        "name": "Puppy Pose",
        "file": "resources\\puppypose.gif",
        "url": "",
        "description": "From child's pose or tabletop, bring your knees together. Walk your fingertips forward and bring your chest onto the mat. Allow your hips to lift high up toward the ceiling, opening up the chest and bending the back. Hold for a few breaths before moving onto another pose.",
        "complete": false,
        "timer": null
    }
}